---
type: PathReinforcementType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# PathReinforcementType

`Autodesk.Revit.DB.Structure.PathReinforcementType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefaultPathReinforcementType | 2015 | `public static ElementId CreateDefaultPathReinforcementType ( Document ADoc )` |
| Property | Parameter | — | `` |